SET sql_mode = 'NO_AUTO_VALUE_ON_ZERO';
SET SQL_SAFE_UPDATES = 0;

INSERT INTO `role` (`r_id`, `r_name`)
VALUES
(0, 'admin'),
(1, 'client');

INSERT INTO `car_status` (`cs_id`, `cs_name`)
VALUES
(0, 'ready'),
(1, 'busy'),
(2, 'inactive');

INSERT INTO `trip_status` (`ts_id`, `ts_name`)
VALUES
(0, 'new'),
(1, 'accepted'),
(2, 'completed'),
(3, 'cancelled');

INSERT INTO `car_category` (`cc_name`, `cc_price`)
VALUES
('Economy', 25),
('Standard', 40),
('Comfort', 50),
('Business', 60),
('Premium', 70);

INSERT INTO `car_category_translation` (`cct_car_category`, `cct_name`, `cct_lang`)
VALUES
(1, 'Economy', 1),
(2, 'Standard', 1),
(3, 'Comfort', 1),
(4, 'Business', 1),
(5, 'Premium', 1),
(1, 'Економ', 2),
(2, 'Стандарт', 2),
(3, 'Комфорт', 2),
(4, 'Бізнес', 2),
(5, 'Преміум', 2);

INSERT INTO `location_translation` (`lt_location`, `lt_street_name`, `lt_street_number`, `lt_lang`)
VALUES
(1, 'Molodizhna', '36', 1),
(2, 'Molodizhna', '54', 1),
(3, 'Molodizhna', '52', 1),
(4, 'Vovchynetska', '225', 1),
(5, 'Ivana-Pavla II', '28', 1),
(6, 'Industrialna', '19', 1),
(7, 'Respublikanska', '22', 1),
(8, 'Hetmana Doroshenka', '22', 1),
(9, 'Hetmana Mazepy', '164', 1),
(10, 'Vasylya Symonenka', '9', 1),
(11, 'Vovchynetska', '206', 1),
(12, 'Vasylya Symonenka', '5A', 1),
(13, 'Maksymovycha', '15', 1),
(14, 'Pasichna', '21', 1),
(15, 'Fedkovycha', '165', 1),
(16, 'Khimikiv', '19B', 1),
(17, 'Troleibusna', '13', 1),
(18, 'Halytska', '124', 1),
(19, 'Akademika Sakharova', '24', 1),
(20, 'Lvivska', '13', 1),
(21, 'Lenkavskoho', '17', 1),
(22, 'Ivana-Pavla II', '20', 1),
(23, 'Parkova', '2', 1),
(24, 'Depovska', '91', 1),
(25, 'Ostrovskoho', '24', 1),
(26, 'Ostrovskoho', '29', 1),
(27, 'Nezalezhnosti', '168', 1),
(28, 'Nezalezhnosti', '196', 1),
(29, 'Nezalezhnosti', '65', 1),
(30, 'Myru', '50', 1),
(31, 'Depovska', '59', 1),
(32, 'Depovska', '25', 1),
(33, 'Lermontova', '44', 1),
(34, 'Halytska', '92', 1),
(35, 'Dovha', '11A', 1),
(36, 'Dnistrovska', '4', 1),
(37, 'Nezalezhnosti', '3', 1),
(38, 'Volodymyra Velykoho', '9', 1),
(39, 'Kopernyka', '9', 1),
(40, 'Halytska', '3A', 1),
(41, 'Belvederska', '2', 1),
(42, 'Shevchenka', '9', 1),
(43, 'Akademika Sakharova', '14B', 1),
(44, 'Mateiky', '59', 1),
(45, 'Mateiky', '33', 1),
(46, 'Vovchynetska', '156', 1),
(47, 'Vovchynetska', '198', 1),
(48, 'Vovchynetska', '21', 1),
(49, 'Halytska', '11', 1),
(50, 'Botanichna', '35', 1),

(1, 'Молодіжна', '36', 2),
(2, 'Молодіжна', '54', 2),
(3, 'Молодіжна', '52', 2),
(4, 'Вовчинецька', '225', 2),
(5, 'Івана-Павла II', '28', 2),
(6, 'Індустріальна', '19', 2),
(7, 'Республіканська', '22', 2),
(8, 'Гетьмана Дорошенка', '22', 2),
(9, 'Гетьмана Мазепи', '164', 2),
(10, 'Василя Симоненка', '9', 2),
(11, 'Вовчинецька', '206', 2),
(12, 'Василя Симоненка', '5А', 2),
(13, 'Максимовича', '15', 2),
(14, 'Пасічна', '21', 2),
(15, 'Федьковича', '165', 2),
(16, 'Хіміків', '19Б', 2),
(17, 'Тролейбусна', '13', 2),
(18, 'Галицька', '124', 2),
(19, 'Академіка Сахарова', '24', 2),
(20, 'Львівська', '13', 2),
(21, 'Ленкавського', '17', 2),
(22, 'Івана-Павла II', '20', 2),
(23, 'Паркова', '2', 2),
(24, 'Деповська', '91', 2),
(25, 'Островського', '24', 2),
(26, 'Островського', '29', 2),
(27, 'Незалежності', '168', 2),
(28, 'Незалежності', '196', 2),
(29, 'Незалежності', '65', 2),
(30, 'Миру', '50', 2),
(31, 'Деповська', '59', 2),
(32, 'Деповська', '25', 2),
(33, 'Лермонтова', '44', 2),
(34, 'Галицька', '92', 2),
(35, 'Довга', '11А', 2),
(36, 'Дністровська', '4', 2),
(37, 'Незалежності', '3', 2),
(38, 'Володимира Великого', '9', 2),
(39, 'Корпенюка', '9', 2),
(40, 'Галицька', '3A', 2),
(41, 'Бельведерська', '2', 2),
(42, 'Шевченка', '9', 2),
(43, 'Академіка Сахарова', '14Б', 2),
(44, 'Матейки', '59', 2),
(45, 'Матейки', '33', 2),
(46, 'Вовчинецька', '156', 2),
(47, 'Вовчинецька', '198', 2),
(48, 'Вовчинецька', '21', 2),
(49, 'Галицька', '11', 2),
(50, 'Ботанічна', '35', 2);

INSERT INTO `language` (`lang_name`)
VALUES
('en'),
('uk');

INSERT INTO `person` (`p_id`, `p_phone`, `p_password`, `p_name`, `p_surname`, `p_role`)
VALUES
(1 ,'0123456789', 'c512a9fa7916b73af750d47eff0e9ca0f01fd69e85b35fbf84df00d81d0ee4ad', 'John', 'Doe', 0); -- password: Admin#00

INSERT INTO `car_model` (`cm_brand`, `cm_name`, `cm_color`, `cm_year`, `cm_seat_count`)
VALUES
('Ford' ,'Focus', 'Blue', 2012, 3),
('Ford' ,'Focus', 'White', 2015, 3),
('Volkswagen' ,'Caddy', 'Blue', 2021, 6),
('Audi' ,'A6', 'Black', 2011, 4),
('Ford' ,'Fusion', 'Blue', 2016, 4),
('BMW' ,'X5', 'Black', 2015, 4),
('Mercedes-Benz' ,'Vito', 'Silver', 2015, 6),
('Ford' ,'Fusion', 'White', 2013, 4);


INSERT INTO `car` (`c_reg_number`, `c_model`, `c_category`, `c_location`, `c_status`)
VALUES
('AA1234TV', 1, 1, 1, 0),
('AA1235TV', 1, 1, 1, 0),
('AA1236TV', 1, 1, 2, 2),

('AA1237TV', 2, 1, 3, 0),
('AA1238TV', 2, 1, 4, 0),
('AA1239TV', 2, 1, 5, 0),

('AA1237TV', 2, 1, 3, 0),
('AA1238TV', 2, 1, 4, 0),
('AA1239TV', 2, 1, 5, 0),

('AA2234TV', 3, 3, 6, 0),
('AA3234TV', 3, 3, 5, 0),
('AA4234TV', 3, 3, 15, 0),

('AA5234TV', 4, 4, 5, 0),
('AA6234TV', 4, 4, 9, 0),
('AA7234TV', 4, 4, 1, 0),

('AA8234TV', 5, 3, 2, 0),
('AA9234TV', 5, 3, 6, 2),
('AA1334TV', 5, 3, 3, 0),

('AA1434TV', 6, 5, 3, 0),
('AA1534TV', 6, 5, 2, 0),
('AA1634TV', 6, 5, 20, 0),

('AA1734TV', 7, 2, 25, 0),
('AA1834TV', 7, 2, 15, 0),
('AA1934TV', 7, 2, 30, 0);

INSERT INTO `location` (`l_street_name`, `l_street_number`, `l_coordinates`)
VALUES
('Molodizhna', '36', POINT(24.737374909778257, 48.925541084296924)),
('Molodizhna', '54', POINT(24.735502852160035, 48.92968587841581)),
('Molodizhna', '52', POINT(24.735872996990068, 48.929033871142096)),
('Vovchynetska', '225', POINT(24.73865635966828, 48.94107697890707)),
('Ivana-Pavla II', '28', POINT(24.740714463072088, 48.93110393701763)),
('Industrialna', '19', POINT(24.723415265888757, 48.91277369251439)),
('Respublikanska', '22', POINT(24.704209520156397, 48.911436863957874)),
('Hetmana Doroshenka', '22', POINT(24.691464286523594, 48.90671824155332)),
('Hetmana Mazepy', '164', POINT(24.737042556138896, 48.92565211504226)),
('Vasylya Symonenka', '9', POINT(24.748059027954042, 48.94284625503577)),
('Vovchynetska', '206', POINT(24.745890344047794, 48.94483640459187)),
('Vasylya Symonenka', '5A', POINT(24.746750109908426, 48.94364253971266)),
('Maksymovycha', '15', POINT(24.725379671366717, 48.94341450070673)),
('Pasichna', '21', POINT(24.695695996555884, 48.939417866685424)),
('Fedkovycha', '165', POINT(24.689476957693937, 48.93978609945551)),
('Khimikiv', '19B', POINT(24.70572339489978, 48.9458801811733)),
('Troleibusna', '13', POINT(24.702218127384022, 48.94659648527823)),
('Halytska', '124', POINT(24.696320669570078, 48.94628449071701)),
('Akademika Sakharova', '24', POINT(24.71043826672713, 48.91424181119112)),
('Lvivska', '13', POINT(24.691334079381065, 48.92056849352145)),
('Lenkavskoho', '17', POINT(24.691334079381065, 48.92056849352145)),
('Ivana-Pavla II', '20', POINT(24.73972952095705, 48.93116947630524)),
('Parkova', '2', POINT(24.73401545853707, 48.9253520485175)),
('Depovska', '91', POINT(24.729112586352315, 48.923366075001866)),
('Ostrovskoho', '24', POINT(24.730050057608892, 48.91884478477301)),
('Ostrovskoho', '29', POINT(24.72795766858213, 48.91752747530948)),
('Nezalezhnosti', '168', POINT(24.73589966428934, 48.91574609793521)),
('Nezalezhnosti', '196', POINT(24.7414454696648, 48.91477669775621)),
('Nezalezhnosti', '65', POINT(24.716875920412537, 48.91897047793667)),
('Myru', '50', POINT(24.731871425462433, 48.92916188348428)),
('Depovska', '59', POINT(24.72686859350118, 48.925615559481955)),
('Depovska', '25', POINT(24.725717127737678, 48.927094693284225)),
('Lermontova', '44', POINT(24.714202994415952, 48.931106091215916)),
('Halytska', '92', POINT(24.70012798228084, 48.94180963648384)),
('Dovha', '11A', POINT(24.706694514776228, 48.93039084219798)),
('Dnistrovska', '4', POINT(24.710814387688945, 48.92497723791581)),
('Nezalezhnosti', '3', POINT(24.70870458463761, 48.921040499723254)),
('Volodymyra Velykoho', '9', POINT(24.70411779315092, 48.92133812349214)),
('Kopernyka', '9', POINT(24.71892552149804, 48.92285151458653)),
('Halytska', '3A', POINT(24.70862253589585, 48.92174308838245)),
('Belvederska', '2', POINT(24.707592658116887, 48.92145809277189)),
('Shevchenka', '9', POINT(24.705565148661183, 48.918824911175776)),
('Akademika Sakharova', '14B', POINT(24.707717411864603, 48.9149029841997)),
('Mateiky', '59', POINT(24.710591893298687, 48.91187699106827)),
('Mateiky', '33', POINT(24.706268172530518, 48.91277248481066)),
('Vovchynetska', '156', POINT(24.71892552149804, 48.92285151458653)),
('Vovchynetska', '198', POINT(24.741324042891744, 48.941022810366256)),
('Vovchynetska', '21', POINT(24.74625099472357, 48.94946130388181)),
('Halytska', '11', POINT(24.709438734753363, 48.922336888655614)),
('Botanichna', '35', POINT(24.71184888655864, 48.896853510819305));